main.floors.lostWorld3=
{
    "floorId": "lostWorld3",
    "title": "迷惘の世界",
    "name": "迷惘の世界",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "mine.ogg",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,13": [
            {
                "type": "confirm",
                "text": "离开将强制扣除：355塔币与145经验\n是否继续？",
                "yes": [
                    {
                        "type": "function",
                        "function": "function(){\ncore.status.hero.money -= 355;\nif (core.status.hero.money < 0) core.status.hero.money = 0;\ncore.status.hero.exp -= 145;\nif (core.status.hero.exp < 0) core.status.hero.exp = 0;\n}"
                    },
                    {
                        "type": "changeFloor",
                        "floorId": "MTWorld",
                        "loc": [
                            16,
                            15
                        ]
                    }
                ],
                "no": []
            }
        ],
        "7,1": [
            {
                "type": "changeFloor",
                "floorId": "lostWorld2",
                "loc": [
                    7,
                    1
                ]
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040, 28,  0,246, 27,365,246, 89,  0,407,  0,  0,407, 27,20042],
    [20040,  0,365,365,  0,365,246,365,365,  0,365,215,365, 34,20042],
    [20040,246, 34,214,246, 27,  0,215,365,215,365, 28,365,407,20042],
    [20040,  0,365, 27,365,334,365,408,  0,408,  0,407,  0, 27,20042],
    [20040,  0,  0,246,  0,  0,365, 27,365,215,365,215,365,215,20042],
    [20040,214,365,215,365,215,365,408, 34,408,215,  0,365,  0,20042],
    [20040,  0,365,226,  0,  0,215,  0,365,  0,365,215,365,215,20042],
    [20040,246,215,  0,365,  0,365,215,365,244,  0,  0,244,244,20042],
    [20040,365,365,334,365,226,  0, 11,218,215,365,215,365,  0,20042],
    [20040,  0,226, 27,  0,215,365,365,  0,365,365,365,244,244,20042],
    [20040, 59,365,365,365,  0,365,215, 11,218, 59,215, 28,365,20042],
    [20040, 28,365,365,224, 28,  0,244,365,365,  0,365, 34,365,20042],
    [20040,226, 34,  0,224,365,365,  0, 89,365,218,218,218,365,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}