main.floors.MT1=
{
    "floorId": "MT1",
    "title": "主塔 1 层",
    "name": "第 1 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,10": [
            "\t[老人,man]魔塔险处逢生，要小心！",
            {
                "type": "setValue",
                "name": "flag:v116_Chat",
                "operator": "+=",
                "value": "1",
                "norefresh": true
            },
            {
                "type": "hide",
                "remove": true
            }
        ],
        "6,12": [
            "\t[老人,man]\b[this]这是测试对话记录本显示的NPC，最终会移除这个NPC",
            "\t[老人,man]\b[this]测试1（去重）@clue",
            "\t[老人,man]\b[this]测试2@clue",
            "\t[老人,man]\b[this]测试自动换行测试自动换行测试自动换行测试自动换行测试自动换行测试自动换行测试自动换行测试自动换行测试自动换行测试自动换行测试自动换行测试自动换行@clue",
            "\t[老人,man]\b[this]测试1（去重）@clue",
            "\t[老人,man]\b[this]测试3@clue",
            "\t[老人,man]\b[this]测试手动换行1\n测试手动换行2\n测试手动换行3@clue",
            "\t[老人,man]\b[this]测试4@clue",
            "\t[老人,man]\b[this]测试\"双引号\"，'单引号'，特殊\\i[notebook]图标@clue"
        ]
    },
    "changeFloor": {
        "7,13": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "7,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "3,6": [
            {
                "type": "setBlock",
                "number": "yellowPotion",
                "loc": [
                    [
                        8,
                        11
                    ]
                ]
            }
        ],
        "11,6": [
            {
                "type": "setBlock",
                "number": "yellowPotion",
                "loc": [
                    [
                        6,
                        11
                    ]
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "8,2": {
            "0": {
                "condition": "flag:hard>=2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "setBlock",
                        "number": "yellowPotion"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,20006,20006,20006,20006,20006,  0, 87,  0,20006,20006,20006,20006,20006,20042],
    [20040,20006, 34,343, 34,20006,  0,  0,  0,20006, 34,345, 34,20006,20042],
    [20040,20006, 28, 32, 28,20006,20006,  0,20006,20006, 28, 32, 28,20006,20042],
    [20040,20006, 27,381, 27,20006,20006, 81,20006,20006, 27,381, 27,20006,20042],
    [20040,20006,20006, 81,20006,20006,  0,379,  0,20006,20006, 81,20006,20006,20042],
    [20040,20006, 21,378, 28,20006,20006,  0,20006,20006, 28,378, 21,20006,20042],
    [20040,20006,  0,378,  0,20006,20006, 81,20006,20006,  0,378,  0,20006,20042],
    [20040,20006,20006, 81,20006,20006,  0,379,  0,20006,20006, 81,20006,20006,20042],
    [20040,20006, 27,377, 32,20006,20006,  0,20006,20006, 32,377, 27,20006,20042],
    [20040,20006,  0,377,  0,20006,20006,121,20006,20006,  0,377,  0,20006,20042],
    [20040,20006,20006, 81,20006,20006,  0,  0,  0,20006,20006, 81,20006,20006,20042],
    [20040,20006, 21,202,  0,20006,121,  0,  0,20006,  0,202, 21,20006,20042],
    [20040,20006, 32,  0,  0,201,  0, 88,  0,201,  0,  0, 32,20006,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "bgm.mp3"
}