main.floors.MT1=
{
    "floorId": "MT1",
    "title": "主塔 1 层",
    "name": "第 1 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,10": [
            "\t[老人,man]魔塔险处逢生，要小心！",
            {
                "type": "setValue",
                "name": "flag:v116_Chat",
                "operator": "+=",
                "value": "1",
                "norefresh": true
            },
            {
                "type": "hide",
                "remove": true
            }
        ],
        "7,14": [
            "\t[H5复刻作者]按4键可以设置自动拾取！",
            {
                "type": "setValue",
                "name": "item:lifeWand",
                "value": "1"
            },
            {
                "type": "confirm",
                "text": "但无脑自动拾取不一定最优，要查看原因吗？\n（多次查看可能丧失探索的乐趣）",
                "yes": [
                    "\t[H5复刻作者]自动拾取绝大部分情况下可以开启，但有一些例外。",
                    "\t[H5复刻作者]魔塔中存在贪心陷阱（其实马上就有），自动拾取不会检测这种陷阱！",
                    "\t[H5复刻作者]魔塔中存在按角色生命比例夹击/吸血的怪物，建议自动拾取的同时开启血瓶道具化",
                    "\t[H5复刻作者]此外，血瓶与宝石效果可能提升，即将提升时建议先开启道具化，效果提升后再通过背包使用钥匙/血瓶。\n\n血瓶效果提升位置：15F商店、85F NPC、-80F NPC\n宝石效果提升位置：15F商店、48F商店、85F NPC、-80F NPC",
                    "\t[H5复刻作者]最后，首次到达-3F会强制清空角色的钥匙、解药，因此即将到达该层时可能需要留着钥匙/解药瓶不捡。（但据原作者透露，完全不留也能通关）",
                    {
                        "type": "confirm",
                        "text": "-3F清空角色钥匙解药可禁用，因为等效于留着不拿\n要禁用吗？禁用后可无脑自动拾取钥匙解药！",
                        "yes": [
                            {
                                "type": "setValue",
                                "name": "flag:Fm3NoKeyDiminish",
                                "value": "1"
                            },
                            "\t[H5复刻作者]-3F清空角色钥匙解药效果已禁用！您可以无脑自动拾取钥匙解药了！"
                        ],
                        "no": [
                            {
                                "type": "setValue",
                                "name": "flag:Fm3NoKeyDiminish",
                                "value": "0"
                            },
                            "\t[H5复刻作者]-3F清空角色钥匙解药效果已启用，遵循原作效果！"
                        ]
                    }
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {
        "7,13": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "7,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "3,6": [
            {
                "type": "setBlock",
                "number": "yellowPotion",
                "loc": [
                    [
                        8,
                        11
                    ]
                ]
            }
        ],
        "11,6": [
            {
                "type": "setBlock",
                "number": "yellowPotion",
                "loc": [
                    [
                        6,
                        11
                    ]
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,20006,20006,20006,20006,20006,  0, 87,  0,20006,20006,20006,20006,20006,20042],
    [20040,20006, 34,343, 34,20006,  0,  0,  0,20006, 34,345, 34,20006,20042],
    [20040,20006, 28, 32, 28,20006,20006,  0,20006,20006, 28, 32, 28,20006,20042],
    [20040,20006, 27,381, 27,20006,20006, 81,20006,20006, 27,381, 27,20006,20042],
    [20040,20006,20006, 81,20006,20006,  0,379,  0,20006,20006, 81,20006,20006,20042],
    [20040,20006, 21,378, 28,20006,20006,  0,20006,20006, 28,378, 21,20006,20042],
    [20040,20006,  0,378,  0,20006,20006, 81,20006,20006,  0,378,  0,20006,20042],
    [20040,20006,20006, 81,20006,20006,  0,379,  0,20006,20006, 81,20006,20006,20042],
    [20040,20006, 27,377, 32,20006,20006,  0,20006,20006, 32,377, 27,20006,20042],
    [20040,20006,  0,377,  0,20006,20006,121,20006,20006,  0,377,  0,20006,20042],
    [20040,20006,20006, 81,20006,20006,  0,  0,  0,20006,20006, 81,20006,20006,20042],
    [20040,20006, 21,202,  0,20006,  0,  0,  0,20006,  0,202, 21,20006,20042],
    [20040,20006, 32,  0,  0,201,  0, 88,  0,201,  0,  0, 32,20006,20042],
    [20048,20049,20049,20049,20049,20049,20049,129,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "bgm.mp3"
}