main.floors.MT24=
{
    "floorId": "MT24",
    "title": "主塔 24 层",
    "name": "第 24 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "xxmtUdG.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,2": [
            "\t[老人,man]\b[this]说一些名词。前一句话对你没帮助，所以对话手册不再记录。",
            "\t[老人,man]\b[this]5大属性：吸血、中毒、衰弱、诅咒、缓慢。(注：缓慢在本H5复刻版中无效)@clue",
            "\t[老人,man]\b[this]6大主力：破甲、领域、反击、魔攻、连击、警卫。@clue",
            "\t[老人,man]\b[this]7大困难：坚固、模仿、自爆、净化、重击、夹击、劲敌。@clue",
            "\t[老人,man]\b[this]吸血怪物先吸取角色34%的HP作为伤害。与一种怪物战斗后，吸血加到怪物本身@clue",
            "\t[老人,man]\b[this]与中毒怪物战斗后，角色每走一格，减生命10点。与一种怪战斗后，减生命20点@clue",
            "\t[老人,man]\b[this]衰弱怪物战斗后，角色攻防减为正常的75%。与一种怪战斗后，衰减为60%@clue",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "7,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "7,13": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,  2,  2,  2, 28,  2, 21, 88, 28,  2, 27,  2,  2,  2,20042],
    [20040,  2, 21, 21, 81,  2,  0,121,  0,  2, 81, 21, 21,  2,20042],
    [20040,  2,  2,  2,224,  2, 31,  0, 21,  2,224,  2,  2,  2,20042],
    [20040, 28,  0,410,  0,  2,  2, 81,  2,  2,  0,410,  0, 27,20042],
    [20040, 60,  2,  2,  0,224,224,334,224,224,  0,  2,  2, 60,20042],
    [20040, 59,410,  0,  0,  2,  2, 81,  2,  2,  0,  0,410, 59,20042],
    [20040,  2,  2,  2,407, 28, 28,406, 28, 28,407,  2,  2,  2,20042],
    [20040, 59,410,  0,  0,  2,  2, 81,  2,  2,  0,  0,410, 59,20042],
    [20040, 60,  2,  2,  0,224,224, 58,224,224,  0,  2,  2, 60,20042],
    [20040,  0, 27,410,  0,  2,  2, 81,  2,  2,  0,410,  0, 28,20042],
    [20040,  2,  2,  2,224,  2, 32,  0, 21,  2,224,  2,  2,  2,20042],
    [20040,  2, 21, 21, 81,  2,  0,  0,  0,  2, 81, 21, 21,  2,20042],
    [20040,  2,  2,  2, 27,  2, 21, 87, 27,  2, 28,  2,  2,  2,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}