main.floors.MT28=
{
    "floorId": "MT28",
    "title": "主塔 28 层",
    "name": "第 28 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "060Slow03.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "13,2": [
            "\t[老人,man]\b[this]反击怪物每回合加角色攻击的10%作为伤害，无视角色防御，当与一种怪战斗后，20%伤害",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "13,12": [
            "\t[老人,man]\b[this]模仿怪物的攻防等于角色的攻防*1。",
            "\t[老人,man]\b[this]如果你无法秒杀怪物，那你的费血应该在15层以内维持在400左右。",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "1,13": [
            {
                "type": "if",
                "condition": "(blockId:1,13===\"portal\")",
                "true": [
                    {
                        "type": "changeFloor",
                        "floorId": "MTWorld",
                        "loc": [
                            9,
                            9
                        ]
                    }
                ],
                "false": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setBlock",
                        "number": "portal"
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "13,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "13,13": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,  0,  1, 31, 31,  1, 28,  1, 28,  1, 31, 31,  1, 88,20042],
    [20040, 32,  1,  1,408,  0,244,  1,244,  0,408,  1,  1,121,20042],
    [20040,211, 32,  1,  0, 81,  1,  1,  1, 81,  0,  1, 32,211,20042],
    [20040,  0,211,  1,  1,408,  0,  0,  0,408,  1,  1,211,  0,20042],
    [20040,  1,  0, 81,407, 27,  1,218,  1, 27,407, 81,  0,  1,20042],
    [20040, 28,244,  1,  0,  1, 29,226, 29,  1,  0,  1,244, 28,20042],
    [20040,  1,  1,  1,  0,218,226,  1,226,218,  0,  1,  1,  1,20042],
    [20040, 28,244,  1,  0,  1, 29,226, 29,  1,  0,  1,244, 28,20042],
    [20040,  1,  0, 81,407, 27,  1,218,  1, 27,407, 81,  0,  1,20042],
    [20040,  0,211,  1,  1,408,  0,  0,  0,408,  1,  1,211,  0,20042],
    [20040,211, 32,  1,  0, 81,  1,  1,  1, 81,  0,  1, 32,211,20042],
    [20040, 32,  1,  1,408,  0,244,  1,244,  0,408,  1,  1,121,20042],
    [20040,383,  1, 31, 31,  1, 28,  1, 28,  1, 31, 31,  1, 87,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}