main.floors.MT34=
{
    "floorId": "MT34",
    "title": "主塔 34 层",
    "name": "第 34 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "060Slow03.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,12": [
            "\t[老人,man]\b[this]这一层不像以前的风格了，这说明这一层很可能与隐藏层有关。@clue",
            {
                "type": "setValue",
                "name": "flag:v116_Chat",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "flag:VerboseHint",
                "true": [
                    "\t[H5复刻作者]提示：魔塔世界中解锁了新的隐藏层。"
                ]
            },
            {
                "type": "show",
                "loc": [
                    [
                        16,
                        15
                    ]
                ],
                "floorId": "MTWorld"
            },
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "7,13": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "7,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,  3,  3, 27,  3, 27,  3, 87,  3, 29,  3,  3, 61,  3,20042],
    [20040, 30,215,  0,214,  0,214,  0, 11,  0,  3,  0,246, 11,20042],
    [20040,  3,  0,  3,  3,214,  3,214,  3,408,  0,246,  3,  0,20042],
    [20040, 27, 27,214, 11,  0,408,  0,  3,  3,  0,  3, 59,408,20042],
    [20040,  3,  3,  3,  0,  3,  3,  0,214,214,224,  3,  3,  0,20042],
    [20040,218,  0,  0,218,  3,  3,218,  3,  3,218,  0,  0,218,20042],
    [20040,  0,  3,  3,215,  0,215,  0, 11,  3,  3,246,  3,  0,20042],
    [20040,224,410,  0, 31,  3, 28,  3,  0,  0,215,  0,  0, 11,20042],
    [20040, 29,  3,  3, 31,  3, 28,  3,224,  3,246,  3,224,  3,20042],
    [20040,  3, 60, 11, 31,215, 28,215, 31,  0,224,  0,  0,246,20042],
    [20040, 29,224,  3,  3,  3,214,  3,  3,  3,246,  3,  3,  0,20042],
    [20040,  3,  0,  3,  3, 60,121,  0,246, 11,  0,246,  0, 11,20042],
    [20040, 29,224,  0,  0,224,  3, 88,  3, 34,  3,  3, 34,  3,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}