main.floors.MT38=
{
    "floorId": "MT38",
    "title": "主塔 38 层",
    "name": "第 38 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "014Theme03.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,5": [
            {
                "type": "openDoor"
            }
        ],
        "4,5": [
            {
                "type": "openDoor"
            }
        ],
        "4,7": [
            {
                "type": "openDoor"
            }
        ],
        "7,12": [
            "\t[老人,man]\b[this]攻击不够，就无法尽快地将之前的怪物对你造成的伤害清零，所以必须尽快加攻击使之前的怪物对你伤害为零。",
            {
                "type": "setValue",
                "name": "flag:v116_Chat",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "7,13": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "7,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,256,244,248,222, 81,  0, 87,  0,  0,  3,  3,  3,  3,20042],
    [20040, 30,  3,  3,  3,  3,  0,  0,  0,  3,  3, 28, 28,  3,20042],
    [20040,  3,  3,  0,214,214,214,  3,  0,256, 81, 28, 28,  3,20042],
    [20040, 33,248,  0,  3,  3,  3,  3,  3,256,  3, 28, 28,  3,20042],
    [20040,248,  3,  3,  3, 28, 34,  3, 27,  0,  3,  3,  3,  3,20042],
    [20040,222,426,248, 81,256, 28,  3, 27,  0,  0,  0,  3, 27,20042],
    [20040,  3,214, 58,  3,  3,  3,  3,  3,  3,  3,248, 81, 28,20042],
    [20040, 60, 58,  3,  3, 34, 34,  3, 27, 27,  3,  0,  3, 34,20042],
    [20040,214,  3,  3, 31,248, 34,  3, 28, 28, 81,248,  3, 29,20042],
    [20040, 27, 27,  3,248,222,248,  3, 29, 29,  3,248,  3,  3,20042],
    [20040,  3,214,  3,  3, 81,  3,  3,  3,  3,  3,248,  0,  3,20042],
    [20040,  0,426,426,426,  0,  0,121, 31, 31,  3, 21, 21,  3,20042],
    [20040,334, 59,  3, 61, 61,  0, 88, 31, 31,  3, 21, 21,  3,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}