main.floors.MT44=
{
    "floorId": "MT44",
    "title": "主塔 44 层",
    "name": "第 44 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "045Positive03.mp3",
    "firstArrive": [
        {
            "type": "if",
            "condition": "(!core.getBlock(7, 13, 'MTn29', false))",
            "true": [
                "\t[H5复刻作者]在不击败-29F领袖的情况下，直接到本层并非作者本意。\n\n15难度真结局原本流程也能通关，\r[lime]本操作视为邪教过关，排行榜将额外记录\"飞跃43F\"，但也计入榜单，仅作赛道区分用途\r。非15难度真结局不受影响。",
                {
                    "type": "setValue",
                    "name": "flag:Buggy44F",
                    "value": "1"
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "7,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "7,13": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,  3,  3,  3,  3,  3,  3, 88,  3,  3,  3,  3,  3,  3,20042],
    [20040,  3,20185,20189,20189,  0,  3,  0,  3,  0,20185,20189,20189,  3,20042],
    [20040,  3, 62,  0,  0,399,  3,  0,  3,399,  0,  0, 62,  3,20042],
    [20040,  3,  0,  0,399,399,  3,  0,  3,399,399,  0,  0,  3,20042],
    [20040,  3,  0,399,399,399,  3,  0,  3,399,399,399,  0,  3,20042],
    [20040,  3,399,399,399,399,  3,  0,  3,399,399,399,399,  3,20042],
    [20040,  3,401,401,401,401,401,401,401,401,401,401,401,  3,20042],
    [20040,  3,399,399,399,399,  3,  0,  3,399,399,399,399,  3,20042],
    [20040,  3,  0,399,399,399,  3,  0,  3,399,399,399,  0,  3,20042],
    [20040,  3,  0,  0,399,399,  3,  0,  3,399,399,  0,  0,  3,20042],
    [20040,  3, 62,  0,  0,399,  3,  0,  3,399,  0,  0, 62,  3,20042],
    [20040,  3,20185,20189,20189,  0,  3,  0,  3,  0,20185,20189,20189,  3,20042],
    [20040,  3,  3,  3,  3,  3,  3, 87,  3,  3,  3,  3,  3,  3,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}