main.floors.MT5=
{
    "floorId": "MT5",
    "title": "主塔 5 层",
    "name": "第 5 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,8": [
            {
                "type": "openDoor"
            }
        ],
        "11,9": [
            {
                "type": "openDoor"
            }
        ],
        "12,2": [
            {
                "type": "openDoor"
            }
        ],
        "12,1": [
            {
                "type": "openDoor"
            },
            "找到隐藏暗墙，攻击+3.",
            {
                "type": "setValue",
                "name": "status:atk",
                "operator": "+=",
                "value": "3"
            }
        ],
        "1,7": [
            "\t[老人,man]\b[this]有些墙可能不是那么坚固。@clue",
            {
                "type": "setValue",
                "name": "flag:v116_Chat",
                "operator": "+=",
                "value": "1",
                "norefresh": true
            },
            {
                "type": "hide",
                "remove": true
            }
        ],
        "2,0": [
            {
                "type": "confirm",
                "text": "本层有一些有关暗墙的提示，是否查看？\n（多次查看提示可能会丧失探索乐趣）",
                "yes": [
                    "\t[H5复刻作者]本层右上角黑色史莱姆周围有暗墙，撞开后可获得3点攻击力。"
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "13,13": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,129,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040, 88,  0,202,201,202,  0,  0,  0, 31, 32,  1,383,  1,20042],
    [20040,  1,  1,  1,  1,  1,  1,  1,  0,  1,  1,  1,383, 22,20042],
    [20040, 31,  0,379,  0, 31, 21,  1,  0,  0,  0,203,203, 22,20042],
    [20040, 32,  0,  1, 31,  1, 32,  1,377,  1,  1,  1,  1,  1,20042],
    [20040, 34,  0,  1,  0, 32,  0,378,378,382,381,380,  0, 32,20042],
    [20040, 28,  0,  1,  1,380,  1,  1,  1,  1,  1,  1,  0,  1,20042],
    [20040,121,  0,  0,  0,  0,203,201,  0, 34,  0,  1,  0,  1,20042],
    [20040,  1,  1,383,  1,  1,  1,  0,  1,  0,  0,  1,  0, 32,20042],
    [20040, 34,205,378,  0,  0,  1,  0,  1,  1,379,383,  0,  1,20042],
    [20040,  1,205,  1,  1, 81,  1,  0,  1,  0,  0,  1, 81,  1,20042],
    [20040,  0,205,  0,  1,  0,  0,382,  0, 34,  0,  1,377,  1,20042],
    [20040, 28, 31, 28,  1, 21,  1,  1,201,  1,  1,  1,  0,  0,20042],
    [20040, 27, 32, 27,  1, 21,  1, 27,201, 31, 28,  1,  0, 87,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}