main.floors.MT56=
{
    "floorId": "MT56",
    "title": "主塔 56 层",
    "name": "第 56 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "040Dungeon06.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "13,3": [
            "\t[老人,man]\b[this]没有足够的药水,你是去不了陷阱沼泽的.@clue",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "1,3": [
            "\t[老人,man]\b[this]这里有个地方可通向陷阱沼泽，你可拿到自然之靴。@clue",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "1,13": [
            {
                "type": "if",
                "condition": "(blockId:1,13===\"portal\")",
                "true": [
                    {
                        "type": "changeFloor",
                        "floorId": "TrapSwamp0",
                        "loc": [
                            7,
                            13
                        ]
                    }
                ],
                "false": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setBlock",
                        "number": "portal"
                    },
                    {
                        "type": "show",
                        "loc": [
                            [
                                4,
                                3
                            ]
                        ],
                        "floorId": "MTWorld"
                    }
                ]
            }
        ],
        "0,2": [
            {
                "type": "confirm",
                "text": "有一些关于自然之靴的提示，是否查看？\n（多次查看可能失去探索的乐趣）",
                "yes": [
                    "\t[H5复刻作者]持有自然之靴可以使路障失效，本层有对应隐藏层的入口，请留意本层的对称性。",
                    "\t[H5复刻作者]但：获得自然之靴需要大量功能性宝物(需破坏至少2熔岩1墙1冰)、一张通行证(或\\i[HSpecialKey]H-特殊钥匙)、并经过大量路障。",
                    "\t[H5复刻作者]请注意：85F需要两张通行证，而从本层到85F期间没有获得通行证的手段。请合理规划资源！"
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {
        "13,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040, 87, 33,20006,20006,20006,20006,20006,20006,20006,20006,20006, 33, 88,20042],
    [129,  0, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11,  0,20042],
    [20040,121, 13,20006, 13,20006,20006,20006,20006,20006, 13,20006, 13,121,20042],
    [20040,20006,401,20006,401,401,401,20006,401,401,401,20006,401,20006,20042],
    [20040,20006, 12, 12, 12,20006, 12,20006, 12,20006, 12, 12, 12,20006,20042],
    [20040,20006, 14,20006,20006,20006, 14,20006, 14,20006,20006,20006, 14,20006,20042],
    [20040,400,400,400,400,400,400,400,400,400,400,400,400,400,20042],
    [20040,399,20006,20006,20006,20006,399,20006,399,20006,20006,20006,20006,399,20042],
    [20040, 11, 11, 11, 11, 11, 11,20006, 11, 11, 11, 11, 11, 11,20042],
    [20040,20006,20006,20006, 13,20006,20006,20006,20006,20006, 13,20006,20006,20006,20042],
    [20040,401,401,401,401,401,401,401,401,401,401,401,401,401,20042],
    [20040,20006, 12,20006, 12,20006,20006,20006,20006,20006, 12,20006, 12,20006,20042],
    [20040,  1, 14,20006, 14, 14, 14, 14, 14, 14, 14,20006, 14, 14,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}