main.floors.MT66=
{
    "floorId": "MT66",
    "title": "主塔 66 层",
    "name": "第 66 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "037Dungeon03.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,1": [
            "\t[老人,man]\b[this]楼层传送器很重要。",
            "\t[老人,man]\b[this]不管魔王界的魔王有多强，他们的领域都是3×3",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "13,1": [
            "\t[老人,man]\b[this]楼层传送器是非作弊工具之一前提是你的传送器可随意传送。",
            "\t[老人,man]\b[this]只讲一遍。",
            "\t[老人,man]\b[this]像陷阱，到了陷阱里，传送一下，就不用再从陷阱里出来等。",
            "\t[老人,man]\b[this]这个不算太作弊，用衰弱陷阱作弊是最好的，至于好在哪，在67层会有答案。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "7,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "7,13": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,121, 33,  3, 33,  3, 33, 88, 33,  3, 33,  3, 33,121,20042],
    [20040,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20042],
    [20040,162,  2,162,  2,162,  2,162,  2,162,  2,162,  2,162,20042],
    [20040,509,  2,509,  2,509,  2,509,  2,509,  2,509,  2,509,20042],
    [20040, 27,  2, 28,  2, 30,  2, 29,  2, 31,  2, 32,  2, 34,20042],
    [20040,509,  2,509,  2,509,  2,509,  2,509,  2,509,  2,509,20042],
    [20040,386,  2,386,  2,386,  2,386,  2,386,  2,386,  2,386,20042],
    [20040,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20042],
    [20040,  1,386,  1,386,  1,522,  0,522,  1,386,  1,386,  1,20042],
    [20040,  1,521,  0,521,  1,  3,162,  3,  1,521,  0,521,  1,20042],
    [20040,  1, 27, 28, 34,  1,522,  0,522,  1, 34, 28, 27,  1,20042],
    [20040,  1, 27, 28, 34,  1,  3,162,  3,  1, 34, 28, 27,  1,20042],
    [20040,  1,  1,  1,  1,  1,  0, 87,  0,  1,  1,  1,  1,  1,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}