main.floors.MT71=
{
    "floorId": "MT71",
    "title": "主塔 71 层",
    "name": "第 71 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "009LastBoss01.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,4": [
            {
                "type": "openDoor"
            }
        ],
        "1,5": [
            {
                "type": "openDoor"
            }
        ],
        "1,6": [
            {
                "type": "openDoor"
            }
        ],
        "2,6": [
            {
                "type": "openDoor"
            }
        ],
        "2,8": [
            {
                "type": "openDoor"
            }
        ],
        "1,8": [
            {
                "type": "openDoor"
            }
        ],
        "6,9": [
            {
                "type": "openDoor"
            }
        ],
        "5,11": [
            {
                "type": "openDoor"
            }
        ],
        "6,11": [
            {
                "type": "openDoor"
            }
        ],
        "8,12": [
            {
                "type": "openDoor"
            }
        ],
        "8,1": [
            {
                "type": "openDoor"
            }
        ],
        "11,7": [
            {
                "type": "openDoor"
            }
        ]
    },
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "13,13": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "3,1": [
            {
                "type": "setValue",
                "name": "flag:s186_F49NoSale",
                "value": "0"
            },
            "\t[H5复刻作者]49F商店已恢复原价！"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040, 88,  0,528,530,530,530,  1,  1, 28,  1, 32,  0, 34,20042],
    [20040,  1,  1, 82,  1,  1,  0,  0,  0,530,  1,  0,530,  0,20042],
    [20040,  1, 32,522, 32,  1,528,  1,528,  1,  1,530,529,530,20042],
    [20040,  1, 32, 32, 32,  1, 81,  1, 81,  1,  1,  1, 81,  1,20042],
    [20040,  1,528, 32, 32,  1,  0,  1,  0,  0, 27,  0, 28,  1,20042],
    [20040,  1,  1,  1,  1,  1,529,  1,  1,  1,529,  1,529,  1,20042],
    [20040, 27,528,530, 27, 28,530,  0,528,  0,528,  1,528,  1,20042],
    [20040,  1,  1,  1,  1,  1,  1,528,  1,  1,  1,  1,  0,  1,20042],
    [20040,  1,528,  1,  1, 34,  1,  0,  1, 23,529, 82,522,  1,20042],
    [20040,  1,  0,531,522,531,  0,522, 82,529,  1,  1,  0,  1,20042],
    [20040,  1, 27,  0,531,  1,  1, 31,  1,  1,522,  0,522,  1,20042],
    [20040, 21,521,  0, 28,  1,  1, 32,  1,  0,521,  1,  1,  1,20042],
    [20040,  1,  1,  1,  1,  1,  1,  1,  1, 22,521, 22,  0, 87,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}