main.floors.MT72=
{
    "floorId": "MT72",
    "title": "主塔 72 层",
    "name": "第 72 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "009LastBoss01.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "12,13": [
            "\t[老人,man]\b[this]这一块的怪物都很强大,所以你不要硬拼.@clue",
            "\t[老人,man]\b[this]你最好选择加防御力。@clue",
            "\t[老人,man]\b[this]一点防御相当于40点HP左右。@clue",
            "\t[老人,man]\b[this]至于攻击，由于你的连击还不够多，所以最好不要加攻击。尽量防杀。@clue",
            "\t[老人,man]\b[this]你的攻击如果接近=怪物HP+DEF÷勇士连击，那你最好选择加攻击。@clue",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "13,13": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "7,3": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {
        "7,9": [
            "\t[巨大八爪章鱼,E532]\b[this]欢迎到来，你将会死的很惨。"
        ]
    },
    "afterBattle": {
        "7,9": [
            "\t[巨大八爪章鱼,E532]\b[this]你打败了我？可恶！你将必死无疑！"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,  0,  0,529,529,  0,531,531,531,  0,  1,  1,  1,  1,20042],
    [20040,528,  1,  1, 81,  1,  1,  1,  1,  0,  1, 25, 25,  1,20042],
    [20040,528,  1,  0,531,  0,  1, 87,  1,  0,  1,529, 25,  1,20042],
    [20040,528,  1, 27, 28, 34,  1,  0,  1,530,  0, 83,529,  1,20042],
    [20040,528,  1, 27, 28, 34,  1,  0,  1,530,  0,  1,  1,  1,20042],
    [20040,  0,  1,  1,  1,  1,  1,  0,  1,  1,530,  0,  0,530,20042],
    [20040,  0,  1, 27, 28,  1,  0, 48,  0,  1,  1,  1,  1,530,20042],
    [20040,522, 81, 27, 28,  1,  0,  0,  0,  1, 23,  0,  1,530,20042],
    [20040, 33,  1, 27, 28,  1,  0,532,  0,  1, 23,530, 81,  0,20042],
    [20040, 34,  0,  1, 82,  1,  1, 83,  1,  1,  1,  1,  1,  0,20042],
    [20040, 33,  1, 21,528, 22,  1, 82,  1, 25, 25, 25, 25, 83,20042],
    [20040,522,  1,  1,  1,  1,  1, 81,  1,  1,  1,  1,  1,  1,20042],
    [20040, 33, 34, 33,522, 33, 34, 33,522, 33, 34, 34,121, 88,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}