main.floors.MT9=
{
    "floorId": "MT9",
    "title": "主塔 9 层",
    "name": "第 9 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "guitar.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,4": [
            {
                "type": "openShop",
                "id": "GoldShop9F",
                "open": true
            }
        ],
        "10,12": [
            {
                "type": "openShop",
                "id": "GoldShop9F2",
                "open": true
            }
        ],
        "0,9": [
            {
                "type": "confirm",
                "text": "有一些关于前期红钥匙的使用提示\n是否查看？",
                "yes": [
                    "\t[H5复刻作者]36~37F，需要前期保存5把红钥匙，因此，前期开红门须谨慎！\n可通过PgUp/PgDn浏览地图提前查看地图并规划。",
                    "\t[H5复刻作者]在获取前期全部红钥匙，且其余一个红门不开的情况下，正常到36F可以持有6把红钥匙。"
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {
        "5,9": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "13,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040, 32, 31, 81, 81,205,216,205,  0,  0,  0,  3,  0, 87,20042],
    [20040,  3,  3,  3,  3,  3,205,  3,  3,  0,  0,  3,  0,  0,20042],
    [20040,  0,  0,  0,  0,  0,  0,  0,  3,  3,  0,  3,203,  0,20042],
    [20040, 32,  3,161,  3,379,378,  0,122,  3,  0,  3,216,  3,20042],
    [20040,  3,  3,382,  3,  3,  3, 81,  3,  3,  0,  0,  0,  0,20042],
    [20040,339,  3, 27,  3, 31,  0,203,  0,  3,382,  3,216,  3,20042],
    [20040,217,  3, 27,  3, 31,  0,  0, 22,  3,  0,  3, 31, 31,20042],
    [20040, 83,  3,382,  3,  3,  3,  3,  3,  3,  0,  3, 32, 32,20042],
    [129, 32,  3,161,  3, 88,  0,  0,  0,  3,382,  3,  3,  3,20042],
    [20040,  0,  0,  0,  0,  0,382,  3,  0,382,203,  0,  0,  3,20042],
    [20040,  3,  3,  3,  3,  3, 81,  3,  3,  3,  3,  3,203,203,20042],
    [20040, 27,205,203,382,381,380,381,382,203,122,  3,203,216,20042],
    [20040,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3, 28,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}