main.floors.MTn18=
{
    "floorId": "MTn18",
    "title": "主塔 -18 层",
    "name": "第 -18 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "001Battle01.mp3",
    "firstArrive": [],
    "eachArrive": [
        {
            "type": "if",
            "condition": "((switch:A !== 1 )&&( flag:v116_Chat>=30))",
            "true": [
                {
                    "type": "setValue",
                    "name": "switch:A",
                    "value": "1"
                },
                {
                    "type": "show",
                    "loc": [
                        [
                            7,
                            6
                        ]
                    ]
                }
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "7,6": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[老人,wizard]\b[this]这是绿钥匙，要节约使用。@clue",
                {
                    "type": "setValue",
                    "name": "item:greenKey",
                    "operator": "+=",
                    "value": "1"
                },
                {
                    "type": "setGlobalValue",
                    "name": "isGreenkeyValid",
                    "value": true
                },
                {
                    "type": "setBlock",
                    "number": "greenKey",
                    "loc": [
                        [
                            6,
                            4
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "greenKey",
                    "loc": [
                        [
                            8,
                            4
                        ]
                    ]
                },
                {
                    "type": "hide",
                    "remove": true
                }
            ]
        },
        "3,11": [
            {
                "type": "openDoor"
            }
        ],
        "5,13": [
            {
                "type": "openDoor"
            }
        ],
        "6,13": [
            {
                "type": "openDoor"
            }
        ],
        "7,13": [
            {
                "type": "openDoor"
            }
        ],
        "8,13": [
            {
                "type": "openDoor"
            }
        ],
        "12,13": [
            {
                "type": "openDoor"
            }
        ],
        "5,2": [
            {
                "type": "openDoor"
            }
        ],
        "1,5": [
            {
                "type": "openShop",
                "id": "Fm18ExpShop"
            },
            {
                "type": "insert",
                "name": "回收钥匙商店"
            }
        ],
        "0,9": [
            {
                "type": "confirm",
                "text": "有一些关于绿钥匙启用的提示，是否查看？\n（多次查看可能失去探索的乐趣）",
                "yes": [
                    "\t[H5复刻作者]与足够的NPC对话后，本层中间将出现一个\\i[wizard]，与之对话即可解锁绿钥匙使用权。"
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {
        "1,9": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "13,1": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,  1,  1,  1,  0,220,220, 31,163,  0,  1,  1,  1, 88,20042],
    [20040, 30,225,  1,  0,383,  0,  0,164, 31,  0,  0,  0,445,20042],
    [20040,  1,225,  0, 30,  1,  1,  1,  1,  1,  0, 21,  1,  1,20042],
    [20040,  1,  1, 34,  1,  1,  0,  1,  0,  1,  1,437, 32,  1,20042],
    [20040,122,445,  0,  1,  0,220,  1,220,  0,  1,  0,  1,  1,20042],
    [20040,  1,  1,443,  1,220,225,125,225,220,  1,441,163,218,20042],
    [20040,  0,  0,443,  1,  1,  1,431,  1,  1,  1,  1,  1,  0,20042],
    [20040,445,  0, 21, 27,  1, 28,443, 28,  1, 47,438,  0,218,20042],
    [129, 87,  1,  1,  1,  1,  1,431,  1,  1,  1,  1,  0,  1,20042],
    [20040,445,  0,  1, 31,  1, 27,443, 27,  1, 31,  0, 21,  1,20042],
    [20040,  0,442,383,439,  1,  1,431,  1,  1,  1,439,  1,  1,20042],
    [20040,  1,  0,440,  0,  0,244,244,244,  0,  1,439,  1,339,20042],
    [20040,  1, 31,  1, 21,383,383,383,383,  0,  0,  0,383,339,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [
    [428,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,428],
    [429,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,429],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [428,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,428],
    [429,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,429]
],
    "underGround": true
}