main.floors.MTn23=
{
    "floorId": "MTn23",
    "title": "主塔 -23 层",
    "name": "第 -23 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "014Theme03.mp3",
    "firstArrive": [
        {
            "type": "if",
            "condition": "(flag:noFixSevereBug!==1)",
            "true": [
                {
                    "type": "insert",
                    "loc": [
                        11,
                        1
                    ]
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,5": [
            {
                "type": "openDoor"
            }
        ],
        "2,9": [
            {
                "type": "openDoor"
            }
        ],
        "12,5": [
            {
                "type": "openDoor"
            }
        ],
        "12,9": [
            {
                "type": "openDoor"
            }
        ],
        "5,13": [
            {
                "type": "openDoor"
            },
            {
                "type": "setBlock",
                "number": "E503"
            }
        ],
        "9,13": [
            {
                "type": "choices",
                "text": "\t[好啊好啊,man]我可让你的传送器在魔塔里随便使用，只需要5000元！我不减你钱！",
                "choices": [
                    {
                        "text": "好啊好啊",
                        "icon": "fly",
                        "need": "status:money>=5000",
                        "action": [
                            {
                                "type": "setGlobalFlag",
                                "name": "flyNearStair",
                                "value": false
                            },
                            {
                                "type": "hide",
                                "remove": true
                            }
                        ]
                    },
                    {
                        "text": "算了",
                        "action": []
                    }
                ]
            }
        ],
        "11,1": [
            "\t[神秘老人,wizard]\b[this,11,1]知道什么是属性爆发么？",
            "\t[神秘老人,wizard]\b[this,11,1]就是你的一种属性达到了现已承受的极限。",
            "\t[神秘老人,wizard]\b[this,11,1]一般分物品极限，普通极限。",
            "\t[神秘老人,wizard]\b[this,11,1]物品极限如圣水，让你生命突然翻倍等。普通极限是指魔塔的属性承受到了极限。",
            "\t[神秘老人,wizard]\b[this,11,1]你的所有能力上限都是9999999.",
            "\t[神秘老人,wizard]\b[this,11,1]你生命到了极限了吧，以前的怪物清光了吧，结束吧，极限的勇士是不可以的！",
            {
                "type": "function",
                "function": "function(){\nvar hero_id = core.getFlag(\"heroId\", 0);\n(hero_id == 0 ? core.status.hero : core.getFlag(\"hero0\")).hp = 5000;\n(hero_id == 1 ? core.status.hero : core.getFlag(\"hero1\")).hp = 5000;\ncore.updateStatusBar(true);\n}"
            },
            {
                "type": "function",
                "function": "function(){\ncore.searchBlock(\"superPotion\", \"MTn22\").forEach(function (block) {\n\tcore.removeBlock(block.x, block.y, \"MTn22\");\n});\n}"
            },
            {
                "type": "setValue",
                "name": "item:superPotion",
                "value": "0"
            },
            {
                "type": "hide",
                "loc": [
                    [
                        11,
                        1
                    ]
                ],
                "remove": true
            }
        ],
        "3,1": [
            "\t[NPC,trader]\b[this]这一层是对称的。我是一个对称事件。",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "11,13": [
            "\t[NPC,trader]\b[this]这一层是对称的。我是一个对称事件。",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "3,13": [
            "\t[老人,man]\b[this]仇恨怪物附加之前积累的仇恨值作为伤害且无视防御和魔防，战斗后，释放一半的仇恨值@clue",
            "\t[老人,man]\b[this]还有，一些楼层只能用上下飞羽才可以到达。@clue",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "13,1": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "1,13": {
            "floorId": "MTn25",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "5,13": [
            {
                "type": "if",
                "condition": "(blockId:9,13===\"E503\")",
                "true": [
                    {
                        "type": "setBlock",
                        "number": "man",
                        "loc": [
                            [
                                9,
                                13
                            ]
                        ]
                    }
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040, 30,237,122,20006,227, 58, 58, 58,227,20006,125,  0, 87,20042],
    [20040,20006,20006,430,20006,430,20006,20006,20006,430,20006,430,20006,20006,20042],
    [20040,20006, 59,  0,20006,  0, 27,20006, 27,  0,20006,  0, 59,20006,20042],
    [20040,227,  0, 34, 11, 34,  0,20006,  0, 34, 11, 34,  0,227,20042],
    [20040,  0,383,20006,20006,20006,430,20006,430,20006,20006,20006,383,  0,20042],
    [20040, 34,20006, 32,  0,504,399,20006,399,504,  0, 32,20006, 34,20042],
    [20040, 11,20006, 29,20006,20006,20006,20006,20006,20006,20006, 29,20006, 11,20042],
    [20040, 34,20006, 32,  0,504,399,20006,399,504,  0, 32,20006, 34,20042],
    [20040,  0,383,20006,20006,20006,430,20006,430,20006,20006,20006,383,  0,20042],
    [20040,227,  0, 34, 11, 34,  0,20006,  0, 34, 11, 34,  0,227,20042],
    [20040,20006, 59,  0,20006, 28,  0,20006,  0, 28,20006,  0, 59,20006,20042],
    [20040,20006,20006,430,20006,20006,430,20006,430,20006,20006,430,20006,20006,20042],
    [20040, 88,20103,121,20006,383, 60, 60, 60,503,20006,122,237, 30,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [
    [428,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,428],
    [429,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,429],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [428,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,428],
    [429,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,429]
],
    "underGround": true
}