main.floors.MTn29=
{
    "floorId": "MTn29",
    "title": "主塔 -29 层",
    "name": "第 -29 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "mtboss.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,8": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[魔头守灵,E507]\b[this]战斗吧！你将死掉！",
                {
                    "type": "battle"
                },
                {
                    "type": "pauseBgm"
                },
                {
                    "type": "sleep",
                    "time": 1000
                },
                "\t[魔头守灵,E507]\b[this]……",
                "\t[hero]\b[hero]为什么？为什么你不死！",
                "\t[魔头守灵,E507]\b[this]......你打败了我。",
                "\t[hero]\b[hero]......",
                "\t[魔头守灵,E507]\b[this]有些事情，你不懂。",
                "\t[hero]\b[hero]......",
                "\t[魔头守灵,E507]\b[this]你就算救出国王和公主，国家还是毁灭的。",
                {
                    "type": "choices",
                    "text": "\t[hero]......",
                    "choices": [
                        {
                            "text": "......毁灭？......",
                            "action": []
                        },
                        {
                            "text": "那我放弃了。",
                            "action": [
                                {
                                    "type": "lose",
                                    "reason": "结局4"
                                }
                            ]
                        },
                        {
                            "text": "避开判负选项(H5专属)",
                            "color": [
                                192,
                                192,
                                192,
                                1
                            ],
                            "action": []
                        }
                    ]
                },
                "\t[魔头守灵,E507]\b[this]只有一个魔塔么？",
                "\t[hero]\b[hero]......我不明白",
                "\t[魔头守灵,E507]\b[this]再见勇士。祝你挽回国家的命运。\n——一个被魔化的勇士留",
                {
                    "type": "show",
                    "loc": [
                        [
                            7,
                            13
                        ]
                    ]
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            6,
                            12
                        ]
                    ],
                    "floorId": "MT43",
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            8,
                            12
                        ]
                    ],
                    "floorId": "MT43",
                    "remove": true
                },
                {
                    "type": "hide",
                    "remove": true
                },
                {
                    "type": "playBgm",
                    "name": "045Positive03.mp3"
                }
            ]
        },
        "7,13": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "7,13": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {
        "7,6": [
            {
                "type": "insert",
                "name": "DynamicPotion",
                "args": [
                    "potion",
                    41
                ]
            }
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040, 87, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31,20042],
    [20040, 31,20005,434, 31,20005, 31, 31, 31,20005, 31,434,20005, 31,20042],
    [20040,20005,20005, 30,20005, 30,20005,435,20005, 30,20005, 30,20005,20005,20042],
    [20040,20005,20005,20005, 30,434,434,435,434,434, 30,20005,20005,20005,20042],
    [20040, 28,20005,20005,20005,434,434,435,434,434,20005,20005,20005, 28,20042],
    [20040, 28, 28, 28,434,434,20005,454,20005,434,434, 28, 28, 28,20042],
    [20040,20005,20005,20005,20005,434,434,  0,434,434,20005,20005,20005,20005,20042],
    [20040,20005,20005, 27,434,434,20005,507,20005,434,434, 27,20005,20005,20042],
    [20040,  0,20005, 27,20005,434,20005,  0,20005,434,20005, 27,20005,  0,20042],
    [20040,  0, 27, 27,20005, 30,20005,434,20005, 30,20005, 27, 27,  0,20042],
    [20040,  0,20005,20005,20005,20005,20005,434,20005,20005,20005,20005,20005,  0,20042],
    [20040,  0,20005, 29, 29,20005,  0,  0,  0,20005, 29, 29,20005,  0,20042],
    [20040,  0,434, 29, 29,20005,  0, 88,  0,20005, 29, 29,434,  0,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [
    [428,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,428],
    [429,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,429],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [428,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,428],
    [429,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,429]
],
    "underGround": true
}