main.floors.MTn56=
{
    "floorId": "MTn56",
    "title": "主塔 -56 层",
    "name": "第 -56 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "061Slow04.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,1": {
            "trigger": "action",
            "enable": true,
            "noPass": true,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "choices",
                    "text": "\t[血瓶,I454]从以后开始，将会非常难，\n是否加HP来满足要求？\n如果你是高手，请不要拿。\n此血瓶\r[red]影响难度评级\r。",
                    "choices": [
                        {
                            "text": "我不是高手，要拿",
                            "need": "flag:PotionLessRate!==1",
                            "action": []
                        },
                        {
                            "text": "我是高手，无视你",
                            "action": [
                                {
                                    "type": "exit"
                                }
                            ]
                        }
                    ]
                },
                {
                    "type": "insert",
                    "name": "DynamicPotion",
                    "args": [
                        "potion",
                        11000
                    ]
                },
                {
                    "type": "hide",
                    "remove": true
                }
            ]
        },
        "6,1": [
            "\t[老人,man]\b[this]你的级别上线是99,不过黄宝石不会受上限的影响。@clue",
            "\t[H5复刻作者]H5版的等级上限超过99，鉴于原版的等级除了魔杖没啥用，所以复刻版干脆也不卡等级上限了。@clue",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "7,1": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "7,13": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {
        "7,6": [
            {
                "type": "insert",
                "name": "DynamicPotion",
                "args": [
                    "potion",
                    4000
                ]
            }
        ],
        "7,8": [
            {
                "type": "insert",
                "name": "DynamicPotion",
                "args": [
                    "gem",
                    4,
                    4,
                    0
                ]
            }
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,  3,  3,  3,  3,  3,121, 87,454,  3,  3,  3,  3,  3,20042],
    [20040,  3, 30,  0, 30,  3,  0,  0,  0,  3, 30,  0, 30,  3,20042],
    [20040,  3,  0, 30,  0,  3,  2,571,  2,  3,  0, 30,  0,  3,20042],
    [20040,  3, 30,573, 30,  3, 31,571, 31,  3, 30,573, 30,  3,20042],
    [20040,  3,  3,573,  3,  3,  2,571,  2,  3,  3,573,  3,  3,20042],
    [20040, 27,  2,  0,  0,574,  0,454,  0,574,  0,  0,  2, 27,20042],
    [20040, 27,  0,  0,  1,  1,  1,162,  1,  1,  1,  0,  0, 27,20042],
    [20040, 27,  2,  0,  0,574,  0,455,  0,574,  0,  0,  2, 27,20042],
    [20040,  3,  3,573,  3,  3,  2,571,  2,  3,  3,573,  3,  3,20042],
    [20040,  3, 30,573, 30,  3, 31,571, 31,  3, 30,573, 30,  3,20042],
    [20040,  3,  0, 30,  0,  3,  2,571,  2,  3,  0, 30,  0,  3,20042],
    [20040,  3, 30,  0, 30,  3,  0,  0,  0,  3, 30,  0, 30,  3,20042],
    [20040,  3,  3,  3,  3,  3,  0, 88,  0,  3,  3,  3,  3,  3,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "underGround": true,
    "bgmap": [

],
    "fgmap": [
    [428,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,428],
    [429,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,429],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [428,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,428],
    [429,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,429]
]
}