main.floors.prison=
{
    "floorId": "prison",
    "title": "地牢",
    "name": "地牢",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,7": [
            "\t[杰克,thief]\b[this]zzzzzz~zzzzzz~",
            "\t[hero,hero]\b[hero]醒醒！！",
            "\t[杰克,thief]\b[this]你啊，找我有事么？",
            "\t[hero,hero]\b[hero]......我们怎么出去啊？",
            "\t[杰克,thief]\b[this]好吧，我送你出去。给你这个。",
            {
                "type": "setValue",
                "name": "item:jumpShoes",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "hide",
                "remove": true
            }
        ],
        "12,7": [
            "\t[老人,man]\b[this]真不知道你是怎么进来的。不过祝贺你。\n（获得8攻8防）",
            {
                "type": "setValue",
                "name": "status:atk",
                "operator": "+=",
                "value": "8"
            },
            {
                "type": "setValue",
                "name": "status:def",
                "operator": "+=",
                "value": "8"
            },
            {
                "type": "hide",
                "remove": true
            }
        ],
        "7,13": [
            {
                "type": "changeFloor",
                "floorId": "MTn3",
                "loc": [
                    1,
                    13
                ]
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,20038,20038,20038,20038,20038,  0,  0,  0,20038,20038,20038,20038,20038,20042],
    [20040,20038, 27, 27, 27,20038,  0,  0,  0,20038, 28, 28, 28,20038,20042],
    [20040,20038, 27, 27, 86, 86,  0,  0,  0, 86, 86, 28, 28,20038,20042],
    [20040,20038, 27, 27, 27,20038,  0,  0,  0,20038, 28, 28, 28,20038,20042],
    [20040,20038,20038,20038,20038,20038,  0,  0,  0,20038,20038,20038,20038,20038,20042],
    [20040,20038,  0,  0,  0,20038,  0,  0,  0,20038,  0,  0,  0,20038,20042],
    [20040,20038,  0,  0,123, 86,  0,  0,  0, 86, 86,  0,121,20038,20042],
    [20040,20038,  0,  0,  0,20038,  0,  0,  0,20038,  0,  0,  0,20038,20042],
    [20040,20038,20038,20038,20038,20038,  0,  0,  0,20038,20038,20038,20038,20038,20042],
    [20040,20038, 30, 30, 30,20038,  0,  0,  0,20038, 29, 29, 29,20038,20042],
    [20040,20038, 30, 30, 86, 86,  0,  0,  0, 86, 86, 29, 29,20038,20042],
    [20040,20038, 30, 30, 30,20038,  0,  0,  0,20038, 29, 29, 29,20038,20042],
    [20040,20038,20038,20038,20038,20038,  0, 89,  0,20038,20038,20038,20038,20038,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}