main.floors.Treasure2=
{
    "floorId": "Treasure2",
    "title": "魔王的宝库",
    "name": "魔王的宝库",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "mine.ogg",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,4": {
            "trigger": null,
            "enable": true,
            "noPass": true,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "3,6": {
            "trigger": null,
            "enable": true,
            "noPass": true,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "3,8": {
            "trigger": "action",
            "enable": true,
            "noPass": true,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "if",
                    "condition": "(blockId:3,8!=='superPotion')",
                    "true": [
                        {
                            "type": "exit"
                        }
                    ]
                },
                {
                    "type": "if",
                    "condition": "(flag:SuperSteelKeyInvalid!==1)",
                    "true": [
                        {
                            "type": "if",
                            "condition": "(flag:SuperSteelKeyAttained!==1)",
                            "true": [
                                {
                                    "type": "confirm",
                                    "default": true,
                                    "text": "您可以获得该圣水，\n但相关难度选项将锁定，确认获得吗？",
                                    "yes": [],
                                    "no": [
                                        {
                                            "type": "exit"
                                        }
                                    ]
                                }
                            ]
                        }
                    ],
                    "false": [
                        "\t[H5难度系统]根据当前难度设置，您不可在宝库获得圣水。\n若确需获得，请在难度页面中修改设置。",
                        {
                            "type": "exit"
                        }
                    ]
                },
                {
                    "type": "setValue",
                    "name": "flag:SuperSteelKeyAttained",
                    "value": "1"
                },
                {
                    "type": "setValue",
                    "name": "item:superPotion",
                    "operator": "+=",
                    "value": "1"
                },
                {
                    "type": "setBgFgBlock",
                    "name": "bg",
                    "number": "ground"
                },
                {
                    "type": "setBlock",
                    "number": "X20006"
                }
            ]
        },
        "3,10": {
            "trigger": null,
            "enable": true,
            "noPass": true,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "7,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "7,13": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {
        "3,10": [
            {
                "type": "setBgFgBlock",
                "name": "bg",
                "number": "ground"
            },
            {
                "type": "setBlock",
                "number": "X20006"
            }
        ],
        "3,6": [
            {
                "type": "setBgFgBlock",
                "name": "bg",
                "number": "ground"
            },
            {
                "type": "setBlock",
                "number": "X20006"
            }
        ],
        "3,4": [
            {
                "type": "setBgFgBlock",
                "name": "bg",
                "number": "ground"
            },
            {
                "type": "setBlock",
                "number": "X20006"
            }
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,20169,20170,20006,20172,  0,  0, 88,20177,20178,20188,20195,20186,20185,20042],
    [20040,20155,20156,20006,  0,  0,  0,  0,  0,  0,  0,  0,20155,20156,20042],
    [20040,  0,20139,20006,20006,20006,20006,20006,20006,20006,20006,  0,20139,  0,20042],
    [20040,20155,20156, 48, 86, 86, 86, 86, 86, 86, 86,  0,20155,20156,20042],
    [20040,  0,20139,20006,20006,20006,20006,20006,20006,20006,20006,  0,20139,  0,20042],
    [20040,20155,20156, 54, 86, 86, 86, 86, 86, 86, 86,  0,20155,20156,20042],
    [20040,  0,20139,20006,20006,20006,20006,20006,20006,20006,20006,  0,20139,  0,20042],
    [20040,20161,20162, 56, 86, 86, 86, 86, 86, 86, 86,  0,20161,20162,20042],
    [20040,20139,  0,20006,20006,20006,20006,20006,20006,20006,20006,  0,  0,20139,20042],
    [20040,20161,20162,333, 86, 86, 86, 86, 86, 86, 86,  0,20161,20162,20042],
    [20040,20139,  0,20006,20006,20006,20006,20006,20006,20006,20006,  0,  0,20139,20042],
    [20040,20161,20162,20006,  0,  0,  0,  0,  0,  0,  0,  0,20161,20162,20042],
    [20040,20139,  0,20006,  0,  0,  0, 87,  0,  0,  0,  0,  0,20139,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20171,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}