main.floors.Treasure3=
{
    "floorId": "Treasure3",
    "title": "魔王的宝库",
    "name": "魔王的宝库",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "mine.ogg",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,10": {
            "trigger": "action",
            "enable": false,
            "noPass": true,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "if",
                    "condition": "(flag:SuperSteelKeyInvalid!==1)",
                    "true": [
                        {
                            "type": "confirm",
                            "default": true,
                            "text": "您可以获得万能铁灭钥匙，\n但相关难度选项将锁定，确认获得吗？",
                            "yes": [],
                            "no": [
                                {
                                    "type": "exit"
                                }
                            ]
                        }
                    ],
                    "false": [
                        "\t[H5难度系统]根据当前难度系统，您不可获得万能铁灭钥匙。\n若确需获得，请在难度页面中修改设置。",
                        {
                            "type": "exit"
                        }
                    ]
                },
                {
                    "type": "setValue",
                    "name": "flag:SuperSteelKeyAttained",
                    "value": "1"
                },
                {
                    "type": "setValue",
                    "name": "item:allSteel",
                    "operator": "+=",
                    "value": "1"
                },
                {
                    "type": "hide",
                    "remove": true
                }
            ]
        },
        "7,0": [
            "\t[H5复刻作者]本层锁在铁门内的是万能铁门钥匙，可以开启所有铁门。",
            "\t[H5复刻作者]如果难度项“万能铁门钥匙不再出现”启用，则不会出现。"
        ]
    },
    "changeFloor": {
        "7,13": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "7,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,129,20041,20041,20041,20041,20041,20041,20042],
    [20040,20169,20170,20171,20172,  0,  0, 87,20177,20178,20188,20195,20186,20185,20042],
    [20040,  0,20007,20007,  0,20007,20007,20007,20007,20007,20007,20007,20007,  0,20042],
    [20040,  0,20007,20007, 86,20007,20007,20007,20007,20007,20007,20007,20007,  0,20042],
    [20040,  0,20007,20007, 86, 86, 86, 86, 86, 25,20007,20007,20007,  0,20042],
    [20040,  0,20007,20007,20007,20007,20007,20007,20007, 86,20007,20007,20007,  0,20042],
    [20040,  0,20007,20007, 25, 86, 86, 86, 86, 25,20007,20007,20007,  0,20042],
    [20040,  0,20007,20007, 86,20007,20007,20007,20007,20007,20007,20007,20007,  0,20042],
    [20040,  0,20007,20007, 25, 86, 86, 86, 86, 25,20007,20007,20007,  0,20042],
    [20040,  0,20007,20007,20007,20007,20007,20007,20007, 86,20007,20007,20007,  0,20042],
    [20040,  0,20007,20007,332, 86, 86, 86, 86, 25,20007,20007,20007,  0,20042],
    [20040,  0,20007,20007,20007,20007,20007,20007,20007,20007,20007,20007,20007,  0,20042],
    [20040,  0,20007,20007,20007,20007,20007,20007,20007,20007,20007,20007,20007,  0,20042],
    [20040,  0,  0,  0,  0,  0,  0, 88,  0,  0,  0,  0,  0,  0,20042],
    [20048,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}