main.floors.Treasure1=
{
    "floorId": "Treasure1",
    "title": "魔王的宝库",
    "name": "魔王的宝库",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "mine.ogg",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,13": [
            {
                "type": "changeFloor",
                "floorId": "MTWorld",
                "loc": [
                    16,
                    5
                ]
            }
        ],
        "7,14": [
            {
                "type": "if",
                "condition": "(flag:SuperSteelKeyInvalid!==1)",
                "true": [
                    "\t[H5复刻作者]这里是宝库，根据当前难度设置，您\r[lime]可以获得宝库中的\\i[allSteel]万能铁门钥匙和\\i[superPotion]圣水\r。但获得后，相关难度选项将被禁用！"
                ],
                "false": [
                    "\t[H5复刻作者]这里是宝库，根据当前难度设置，宝库\r[#FF60FF]所有的\\i[allSteel]万能铁门钥匙和\\i[superPotion]圣水将不可获得\r。如果确实需要该物品，请在难度系统中取消相关选项的选择！（位于难度配置->血瓶宝物相关）"
                ]
            }
        ]
    },
    "changeFloor": {
        "7,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20040,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20041,20042],
    [20040,20169,20170,20171,20172,  0,  0, 87,20177,20178,20188,20195,20186,20185,20042],
    [20040,20155,20156,  0,20006,20006,20006,20006,20006,20006,20006,  0,20155,20156,20042],
    [20040,  0,20139,  0,20006, 32, 32, 32,20006, 34,20006,  0,20139,  0,20042],
    [20040,20155,20156,  0,20006, 32, 32, 32,20006, 34,20006,  0,20155,20156,20042],
    [20040,  0,20139,  0,20006, 32, 32, 32,20006, 34,20006,  0,20139,  0,20042],
    [20040,20155,20156,  0,20006, 32, 86, 32,20006, 34,20006,  0,20155,20156,20042],
    [20040,  0,20139,  0,  0,20006, 86,20006, 86, 86,20006,  0,20139,  0,20042],
    [20040,20161,20162,  0, 25,20006, 86,20006, 86, 86,20006,  0,20161,20162,20042],
    [20040,20139,  0,  0, 25,20006, 86,20006, 86, 86,20006,  0,  0,20139,20042],
    [20040,20161,20162,  0, 25,20006, 86,20006, 86, 86,20006,  0,20161,20162,20042],
    [20040,20139,  0,  0, 25,20006, 86,20006, 86,20006,20006,  0,  0,20139,20042],
    [20040,20161,20162,  0, 25,  0,  0,  0,  0,  0,  0,  0,20161,20162,20042],
    [20040,20139,  0,  0, 25,  0,  0, 89,  0,  0,  0,  0,  0,20139,20042],
    [20048,20049,20049,20049,20049,20049,20049,129,20049,20049,20049,20049,20049,20049,20050]
],
    "bgmap": [

],
    "fgmap": [

]
}